app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    @title = "Transport Management User Profile"
    @user = User.find(session[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @title = "Edit Your Information"
    @user = User.find(session[:user_id])

INSERT INTO `users` (`created_at`, `updated_at`, `admin`, `password`, `screen_name`, `email`) VALUES('2012-03-10 14:53:12', '2012-03-10 14:53:12', 0, 'admin123', 'admin', 'admin@test.com')
---
  def register
    @title = "Register"
    if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM `users` WHERE (`users`.`password` = 'test' AND `users`.`screen_name` = 'test') LIMIT 1
---
  def login
    @title = "Log in to Transport Management"
    if param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name,
        @user.password)