app/controllers/vehicle_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `vehicles`
---
  def index
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @user = User.find(session[:user_id])
    @vehicles = Vehicle.all

SELECT * FROM `vehicles`
SELECT * FROM `vehicles` WHERE (`vehicles`.`from` = 'Chennai' AND `vehicles`.`to` = 'Erode' AND `vehicles`.`sub_type` = 'Passenger' AND `vehicles`.`main_type` = 'Train')
SELECT * FROM `vehicles` WHERE (`vehicles`.`sub_type` IS NULL AND `vehicles`.`main_type` IS NULL)
---
  def search
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    if params[:vehicle].present?
      @vehicles = Vehicle.find_all_by_from_and_to_and_main_type_and_sub_type(params[:vehicle][:from], params[:vehicle][:to], params[:vehicle][:type], params[:vehicle][:sub_type])
      @vehicles = @vehicles.select{|veh| veh.available > params[:vehicle][:available].to_i}

INSERT INTO `vehicles` (`number`, `created_at`, `main_type`, `available`, `sub_type`, `from`, `updated_at`, `to`, `capacity`) VALUES('1234', '2012-03-10 14:25:44', 'Bus', NULL, 'Deluxe', 'Chennai', '2012-03-10 14:25:44', 'Erode', 45)
---
  def register
    @title = "Register New Vehicle"
    if param_posted?(:vehicle)
      @vehicle = Vehicle.new(params[:vehicle])
      if @vehicle.save